### US Trade Analysis
##### Years Covered - 1998 - 2018

In [2]:
###Code Header

import pandas as pd

In [3]:
#Importing the trade datasets from csv files. Skipping the first two rows which are meta data

# The US Import/Export datasets have been taken from the the USA trade online website hosted by the US Department of Commerce - https://usatrade.census.gov
exports98 = pd.read_csv("../data/US Trade Data/USA Exports - 1998 - 2008.csv", skiprows = 2)
exports09 = pd.read_csv("../data/US Trade Data/USA Exports - 2009 - 2018.csv", skiprows = 2)
imports98 = pd.read_csv("../data/US Trade Data/USA Imports - 1998 - 2008.csv", skiprows = 2)
imports09 = pd.read_csv("../data/US Trade Data/USA Imports - 2009 - 2018.csv", skiprows = 2)
# The Consumer Price Index is the collective price of a bucket of predecided category of goods like fuel, food, air fare, clothing etc, that together give us an idea of the value of money at the time
# The CPI dataset has been taken from the Bureau of Labor Statistics website hosted by the United States Department of Labor - https://data.bls.gov

In [4]:
exports98.head()

         Commodity Country  Time Value ($US)  Unnamed: 4
0  01 Live Animals  Angola  2002      36,638         NaN
1  01 Live Animals  Angola  2003      78,085         NaN
2  01 Live Animals  Angola  2005      11,578         NaN
3  01 Live Animals  Angola  2007      12,400         NaN
4  01 Live Animals   Benin  2005       6,720         NaN

In [5]:
imports09.head()

         Commodity Country  Time Customs Value (Gen) ($US)  Unnamed: 4
0  01 Live Animals   Benin  2009                    47,606         NaN
1  01 Live Animals   Benin  2010                   141,576         NaN
2  01 Live Animals   Benin  2011                   113,086         NaN
3  01 Live Animals   Benin  2012                   254,998         NaN
4  01 Live Animals   Benin  2013                   203,133         NaN

In [6]:
imports98.head()

         Commodity Country  Time Customs Value (Gen) ($US)  Unnamed: 4
0  01 Live Animals   Benin  1998                   551,769         NaN
1  01 Live Animals   Benin  1999                   547,131         NaN
2  01 Live Animals   Benin  2000                   563,711         NaN
3  01 Live Animals   Benin  2001                   698,417         NaN
4  01 Live Animals   Benin  2002                   515,459         NaN

In [7]:
exports09.head()

         Commodity  Country  Time Value ($US)  Unnamed: 4
0  01 Live Animals  Algeria  2010      52,789         NaN
1  01 Live Animals  Algeria  2013     164,515         NaN
2  01 Live Animals  Algeria  2014     152,533         NaN
3  01 Live Animals  Algeria  2015   1,289,368         NaN
4  01 Live Animals  Algeria  2016   1,984,461         NaN

In [14]:
exports09 = exports09.rename(columns = {'Exported $': 'Export Value'})
exports98 = exports98.rename(columns = {'Value ($US)': 'Export Value'})

In [16]:
imports09 = imports09.rename(columns = {'Customs Value (Gen) ($US)': 'Imported Value'})
imports98 = imports98.rename(columns = {'Customs Value (Gen) ($US)': 'Imported Value'})

         Commodity Country  Time Imported Value  Unnamed: 4
0  01 Live Animals   Benin  2009         47,606         NaN
1  01 Live Animals   Benin  2010        141,576         NaN
2  01 Live Animals   Benin  2011        113,086         NaN
3  01 Live Animals   Benin  2012        254,998         NaN
4  01 Live Animals   Benin  2013        203,133         NaN